/* 
Zadanie 7 Зарплата менеджера составляет 200$ + процент от продаж, 
продажи до 500$ - 3%, от 500 до 1000 – 5%, свыше 1000 – 8%. пользователь вводит с клавиатуры 
уровень продаж для трех менеджеров..определить их зарплату, лучшего менеджера,
начислить ему премию  200$, вывести итоги на экран.*/

 #include <iostream> 
using namespace std; 

int main() { 
setlocale(LC_ALL, "Russian");

int a, b, c;
int s1, s2, s3;
cout << "Введите уровень продаж для трех менеджеров\n";
    cin >> a >> b >> c;
    
  
if (a>1000)
    s1 = a*0.08 + 200;
else if (a>500)
    s1 = a*0.05 + 200;
else s1 = a*0.03 + 200;



if (b>1000)
    s2 = b*0.08 + 200;
else if (b>500)
    s2= b*0.05 + 200;
else s2 = b*0.03 + 200;
   
    
    
if (c>1000)
    s3 = c*0.08 + 200;
else if (c>500)
    s3 = c*0.05 + 200;
else  s3 = c*0.03 + 200;


if (a > b && a > c)
s1 = s1 + 200;
else
        if (b > c)
            s2 = s2 + 200;
        else
            s3 = s3 + 200;
     cout << "ЗП 1 менеджера:" << s1 << "$" << endl;
    cout << "ЗП 1 менеджера:" << s2 << "$" << endl;
    cout << "ЗП 1 менеджера:" << s3 << "$" << endl;
     
return 0;
}
